proddy/EMS-ESP32/src/core/system.cpp
    LOG_INFO("Message: %s", EMSESP::webSchedulerService.computed_value.c_str());  // send to log
    Mqtt::queue_publish(F_(message), EMSESP::webSchedulerService.computed_value); // send to MQTT if enabled
    output["api_data"] = EMSESP::webSchedulerService.computed_value;              // send to API
    EMSESP::webSchedulerService.computed_value.clear();
    EMSESP::webSchedulerService.computed_value.shrink_to_fit();
    return true;
}

// watch
bool System::command_watch(const char * value, const int8_t id) {
    uint8_t  w = 0xff;
    uint16_t i = Helpers::hextoint(value);
    if (Helpers::value2enum(value, w, FL_(list_watch))) {
        if (w == 0 || EMSESP::watch() == EMSESP::Watch::WATCH_OFF) {
            EMSESP::watch_id(0);
        }
        if (Mqtt::publish_single() && w != EMSESP::watch()) {
            if (Mqtt::publish_single2cmd()) {
                Mqtt::queue_publish("system/watch", EMSESP::system_.enum_format() == ENUM_FORMAT_INDEX ? Helpers::itoa(w) : (FL_(list_watch)[w]));
            } else {
                Mqtt::queue_publish("system_data/watch", EMSESP::system_.enum_format() == ENUM_FORMAT_INDEX ? Helpers::itoa(w) : (FL_(list_watch)[w]));
            }
        }
        EMSESP::watch(w);
        return true;
    } else if (i) {
        if (Mqtt::publish_single() && i != EMSESP::watch_id()) {
            if (Mqtt::publish_single2cmd()) {
                Mqtt::queue_publish("system/watch", Helpers::hextoa(i));
            } else {
                Mqtt::queue_publish("system_data/watch", Helpers::hextoa(i));
            }
        }
        EMSESP::watch_id(i);
        if (EMSESP::watch() == EMSESP::Watch::WATCH_OFF) {
            EMSESP::watch(EMSESP::Watch::WATCH_ON);
        }
        return true;
    }
    return false;
}

void System::store_nvs_values() {
    if (Command::find_command(EMSdevice::DeviceType::BOILER, 0, "nompower", 0) != nullptr) {
        Command::call(EMSdevice::DeviceType::BOILER, "nompower", "-1"); // trigger a write
    }
    EMSESP::analogsensor_.store_counters();
    EMSESP::nvs_.end();
}

// Build up a list of all partitions and their version info
void System::get_partition_info() {
    partition_info_.clear(); // clear existing data

#ifdef EMSESP_STANDALONE
    // dummy data for standalone mode - version, size, install_date in UTC epoch
    partition_info_["app0"]    = {EMSESP_APP_VERSION, 0, 0};
    partition_info_["app1"]    = {"", 0, 0};
    partition_info_["factory"] = {"", 0, 0};
    partition_info_["boot"]    = {"", 0, 0};
#else

    auto current_partition = (const char *)esp_ota_get_running_partition()->label;

    // update the current version and partition name in NVS if not already set
    if (EMSESP::nvs_.getString(current_partition) != EMSESP_APP_VERSION || emsesp::EMSESP::nvs_.getBool(emsesp::EMSESP_NVS_BOOT_NEW_FIRMWARE, true)) {
        EMSESP::nvs_.putBool(emsesp::EMSESP_NVS_BOOT_NEW_FIRMWARE, false);
        EMSESP::nvs_.putString(current_partition, EMSESP_APP_VERSION);
        char c[20];
        snprintf(c, sizeof(c), "d_%s", current_partition);
        auto t = time(nullptr);
        // write timestamp always with new version, if clock is not set, this will be updated with ntp
        EMSESP::nvs_.putULong(c, t);
    }

    // Loop through all available partitions and update map with the version info pulled from NVS
    // Partitions can be app0, app1, factory, boot
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, nullptr);
    uint64_t                 buffer;

    while (it != nullptr) {
        bool                    is_valid = true;
        const esp_partition_t * part     = esp_partition_get(it);

        if (part->label != nullptr && part->label[0] != '\0') {
            // check if partition is valid and not empty
            esp_partition_read(part, 0, &buffer, 8);
            if (buffer == 0xFFFFFFFFFFFFFFFF) {
                is_valid = false; // skip this partition
            }
        }

        // get the version from the NVS store, and add to map
        if (is_valid) {
            PartitionInfo p_info;
            // if there is an entry for this partition in NVS, get it's version from NVS
            p_info.version = EMSESP::nvs_.getString(part->label, "").c_str();
            char c[20];
            snprintf(c, sizeof(c), "d_%s", (const char *)part->label);
            time_t d            = EMSESP::nvs_.getULong(c, 0);
            p_info.install_date = d > 1500000000L ? d : 0; // store UTC epoch; formatted to local time at render

            if (!p_info.version.empty()) {
                esp_image_metadata_t meta     = {};
                esp_partition_pos_t  part_pos = {.offset = part->address, .size = part->size};
                if (esp_image_verify(ESP_IMAGE_VERIFY_SILENT, &part_pos, &meta) == ESP_OK) {
                    p_info.size = meta.image_len / 1024; // actual firmware size in KB
                } else {
                    p_info.size = 0;
                }
                partition_info_[part->label] = p_info;
            }
        }

        it = esp_partition_next(it); // loop to next partition
    }
    esp_partition_iterator_release(it);
#endif
}

// set install time/date for the current partition, in UTC
// assumes NTP is connected and working
void System::set_partition_install_date() {
#ifndef EMSESP_STANDALONE
    auto current_partition = (const char *)esp_ota_get_running_partition()->label;
    if (current_partition == nullptr) {
        return; // fail-safe
    }

    char c[20];
    snprintf(c, sizeof(c), "d_%s", current_partition);
    time_t d = EMSESP::nvs_.getULong(c, 0);
    if (d < 1500000000L) {
        LOG_DEBUG("Setting the NTP install date in partition %s", current_partition);
        auto t = time(nullptr) - uuid::get_uptime_sec();
        EMSESP::nvs_.putULong(c, t);
    }
#endif
}

// sets the partition to use on the next restart
bool System::set_partition(const char * partitionname) {
#ifdef EMSESP_STANDALONE
    return true;
#else
    if (partitionname == nullptr) {
        return false;
    }

    // Find the partition by label
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, partitionname);
    if (it == nullptr) {
        return false; // partition not found
    }

