proddy/EMS-ESP32/src/core/system.cpp
    return false; // no reboot required
}

#ifndef EMSESP_STANDALONE
// map each config filename to its human-readable section key
static const std::pair<const char *, const char *> SECTION_MAP[] = {
    {NETWORK_SETTINGS_FILE, "Network"},
    {AP_SETTINGS_FILE, "AP"},
    {MQTT_SETTINGS_FILE, "MQTT"},
    {NTP_SETTINGS_FILE, "NTP"},
    {SECURITY_SETTINGS_FILE, "Security"},
    {EMSESP_SETTINGS_FILE, "Settings"},
    {EMSESP_SCHEDULER_FILE, "Schedule"},
    {EMSESP_CUSTOMIZATION_FILE, "Customizations"},
    {EMSESP_CUSTOMENTITY_FILE, "Entities"},
    {EMSESP_MODULES_FILE, "Modules"},
};
#endif

// convert a single config file into a section of the output json object
void System::exportSettings(const std::string & type, const char * filename, JsonObject output) {
    if (type != "settings") {
        output["type"] = type; // add the type to the output, not for settings as it's already added because its grouped
    }

#ifndef EMSESP_STANDALONE
    const char * section = nullptr;
    for (const auto & [f, label] : SECTION_MAP) {
        if (strcmp(f, filename) == 0) {
            section = label;
            break;
        }
    }

    if (!section) {
        return;
    }

    File settingsFile = LittleFS.open(filename);
    if (settingsFile) {
        {
            JsonDocument         jsonDocument;
            DeserializationError error = deserializeJson(jsonDocument, settingsFile);
            settingsFile.close(); // close early, we no longer need the file
            if (error || !jsonDocument.is<JsonObject>()) {
                LOG_ERROR("Failed to deserialize settings file %s", filename);
                return;
            }
            output[section].set(jsonDocument.as<JsonObject>());
        }
        LOG_DEBUG("Exported %s settings from file %s", section, filename);
    } else {
        LOG_ERROR("No settings file for %s found", filename);
    }
#endif
}

// full system backup of all settings files
void System::exportSystemBackup(JsonObject output) {
    output["type"]    = "systembackup";     // add the type to the output
    output["version"] = EMSESP_APP_VERSION; // add the version to the output

#ifndef EMSESP_STANDALONE
    // add date/time if NTP enabled and active
    if ((esp_sntp_enabled()) && (EMSESP::system_.ntp_connected())) {
        time_t now = time(nullptr);
        if (now > 1500000000L) {
            char t[25];
            strftime(t, sizeof(t), "%FT%T", localtime(&now));
            output["date"] = t;
        }
    }
#endif

    // create an array of objects for each settings file
    JsonArray nodes = output["systembackup"].to<JsonArray>();

    // start with settings by grouping them together
    JsonObject node = nodes.add<JsonObject>();
    node["type"]    = "settings"; // add type once for this group
    exportSettings("settings", NETWORK_SETTINGS_FILE, node);
    exportSettings("settings", AP_SETTINGS_FILE, node);
    exportSettings("settings", MQTT_SETTINGS_FILE, node);
    exportSettings("settings", NTP_SETTINGS_FILE, node);
    exportSettings("settings", SECURITY_SETTINGS_FILE, node);
    exportSettings("settings", EMSESP_SETTINGS_FILE, node);

    node = nodes.add<JsonObject>();
    exportSettings("schedule", EMSESP_SCHEDULER_FILE, node);
    node = nodes.add<JsonObject>();
    exportSettings("customizations", EMSESP_CUSTOMIZATION_FILE, node);
    node = nodes.add<JsonObject>();
    exportSettings("entities", EMSESP_CUSTOMENTITY_FILE, node);
    node = nodes.add<JsonObject>();
    exportSettings("modules", EMSESP_MODULES_FILE, node);

#ifndef EMSESP_STANDALONE
    // special case for custom support
    File file = LittleFS.open(EMSESP_CUSTOMSUPPORT_FILE, "r");
    if (file) {
        JsonDocument         jsonDocument;
        DeserializationError error = deserializeJson(jsonDocument, file);
        file.close(); // close early, we no longer need the file
        if (!error && jsonDocument.is<JsonObject>()) {
            JsonObject support_node = nodes.add<JsonObject>();
            support_node["type"]    = "customSupport";
            support_node["data"].set(jsonDocument.as<JsonObject>());
            LOG_DEBUG("Exported custom support file %s", EMSESP_CUSTOMSUPPORT_FILE);
        } else {
            LOG_ERROR("Failed to deserialize custom support file");
        }
    }

    // Backup NVS values
    node         = nodes.add<JsonObject>();
    node["type"] = "nvs";

    const char *   nvs_part = esp_partition_find_first(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_DATA_NVS, "nvs1") ? "nvs1" : "nvs"; // nvs1 is on 16MBs
    nvs_iterator_t it       = nullptr;
    esp_err_t      err      = nvs_entry_find(nvs_part, "ems-esp", NVS_TYPE_ANY, &it);
    if (err != ESP_OK) {
        LOG_ERROR("Failed to find NVS entry for %s", nvs_part);
        return;
    }

    JsonArray entries = node["nvs"].to<JsonArray>();
    while (err == ESP_OK) {
        nvs_entry_info_t info;
        nvs_entry_info(it, &info);
        JsonObject entry = entries.add<JsonObject>();
        entry["type"]    = info.type;
        entry["key"]     = info.key;

        LOG_DEBUG("Exporting NVS value: %s = %d", info.key, info.type);

        switch (info.type) {
        case NVS_TYPE_I8:
            entry["value"] = EMSESP::nvs_.getChar(info.key);
            break;
        case NVS_TYPE_U8:
            entry["value"] = EMSESP::nvs_.getUChar(info.key);
            break;
        case NVS_TYPE_I32:
            entry["value"] = EMSESP::nvs_.getInt(info.key);
            break;
        case NVS_TYPE_U32:
            entry["value"] = EMSESP::nvs_.getUInt(info.key);
            break;
        case NVS_TYPE_I64:
            entry["value"] = EMSESP::nvs_.getLong64(info.key);
            break;
        case NVS_TYPE_U64:
            entry["value"] = EMSESP::nvs_.getULong64(info.key);
            break;
        case NVS_TYPE_BLOB:
            entry["value"] = EMSESP::nvs_.getDouble(info.key); // bytes used for double values
            break;
        case NVS_TYPE_STR:
        case NVS_TYPE_ANY:
        default:
            entry["value"] = EMSESP::nvs_.getString(info.key);
            break;
        }
        err = nvs_entry_next(&it);
    }

