proddy/EMS-ESP32/src/core/system.cpp
    return true;
}

// led command
// https://github.com/emsesp/EMS-ESP32/issues/3063
// /api//system/led command that takes an argument in the form [color]:[pattern]
// color is red, green, blue, yellow, white
// pattern is
//  blink1 for 1 time
//  blink2 for 2 times
//  blink3 for 3 times
//  rgb for RGB
// For example: /api/system/led?data=red:blink1
// For older non-RGB models, the colour would default to just being on.
bool System::command_led(const char * value, const int8_t id) {
    if (!value) {
        return false; // no argument
    }

    std::string arg = value;
    if (arg.find(':') == std::string::npos) {
        LOG_ERROR("LED command must be in the form [color]:[pattern]");
        return false; // not in the form [color]:[pattern]
    }
    std::string color   = arg.substr(0, arg.find(':'));
    std::string pattern = arg.substr(arg.find(':') + 1);

    // the color must be red, green, blue, yellow, white
    // the style must be blink1, blink2, blink3
    if ((color != "red" && color != "green" && color != "blue" && color != "yellow" && color != "white")
        || (pattern != "blink1" && pattern != "blink2" && pattern != "blink3" && pattern != "rgb")) {
        LOG_ERROR("Invalid format. Must be [red|green|blue|yellow|white]:[blink1|blink2|blink3|rgb]");
        return false;
    }

    EMSESP::led_.set_led_routine(color, pattern);

    return true;
}

// txpause command - temporarily pause the TX, by setting Txmode to 0 (disabled)
bool System::command_txpause(const char * value, const int8_t id) {
    bool arg;
    if (!Helpers::value2bool(value, arg)) {
        return false; // argument not recognized
    }

    if (!arg) {
        // arg = false: Tx mode to 0 (disabled) to pause
        if (EMSbus::tx_mode() == EMS_TXMODE_OFF) {
            EMSESP::webSettingsService.read([&](WebSettings & settings) {
                EMSbus::tx_mode(settings.tx_mode);
#ifdef EMSESP_DEBUG
                LOG_INFO("TX mode restored (value %d)", settings.tx_mode);
#else
                LOG_INFO("TX active");
#endif
            });
        }
    } else {
        // pause = true: Tx mode to 0 (disabled) to pause
        if (EMSbus::tx_mode() != EMS_TXMODE_OFF) {
            EMSbus::tx_mode(EMS_TXMODE_OFF);
#ifdef EMSESP_DEBUG
            LOG_INFO("TX mode set to OFF (value %d)", EMS_TXMODE_OFF);
#else
            LOG_INFO("TX paused");
#endif
        }
    }
    return true;
}

// format command - factory reset, removing all config files
bool System::command_format(const char * value, const int8_t id) {
#if !defined(EMSESP_STANDALONE) && !defined(EMSESP_TEST)
    // don't really format the filesystem in test or standalone mode
    if (LittleFS.format()) {
        LOG_INFO("Filesystem formatted successfully. All config files removed.");
    } else {
        LOG_ERROR("Format failed");
    }
#else
    LOG_ERROR("Format command not available in standalone or test mode");
#endif

    // restart will be handled by the main loop
    EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_RESTART_REQUESTED);
    return true;
}

// restart command - perform a hard reset (system reboot)
bool System::command_restart(const char * value, const int8_t id) {
    if (id == 0) {
        // if it has an id then it's a web call and we need to queue the restart
        // default id is -1 when calling /api/system/restart directly for example
        LOG_INFO("Preparing to restart system");
        EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_PENDING_RESTART);
        return true;
    }

    LOG_INFO("Restarting system immediately");
    // restart will be handled by the main loop
    EMSESP::system_.systemStatus(SYSTEM_STATUS::SYSTEM_STATUS_RESTART_REQUESTED);
    return true;
}

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wswitch"

std::string System::reset_reason(uint8_t cpu) const {
#ifndef EMSESP_STANDALONE
    switch (esp_rom_get_reset_reason(cpu)) {
    case RESET_REASON_CHIP_POWER_ON:
        return ("Power on reset");
    case 2: // not on esp32
        return ("reset pin");
    case RESET_REASON_CORE_SW:
        return ("Software reset");
    case 4: // not on S2, C3
        return ("Legacy watch dog reset");
    case RESET_REASON_CORE_DEEP_SLEEP:
        return ("Deep sleep reset");
    case 6: // RESET_REASON_CORE_SDIO: // not on S2, S3, C3
        return ("Reset by SDIO");
    case RESET_REASON_CORE_MWDT0:
        return ("Timer group0 watch dog reset");
    case RESET_REASON_CORE_MWDT1:
        return ("Timer group1 watch dog reset");
    case RESET_REASON_CORE_RTC_WDT:
        return ("RTC watch dog reset");
    case 10:
        return ("Intrusion reset CPU");
    case RESET_REASON_CPU0_MWDT0:
        return ("Timer group reset CPU");
    case RESET_REASON_CPU0_SW:
        return ("Software reset CPU");
    case RESET_REASON_CPU0_RTC_WDT:
        return ("RTC watch dog reset: CPU");
    case 14: // RESET_REASON_CPU1_CPU0: // not on S2, S3, C3
        return ("APP CPU reset by PRO CPU");
    case RESET_REASON_SYS_BROWN_OUT:
        return ("Brownout reset");
    case RESET_REASON_SYS_RTC_WDT:
        return ("RTC watch dog reset: CPU+RTC");
    default:
        break;
    }
#endif
    return "Unknown";
}
#pragma GCC diagnostic pop

// set NTP status
void System::ntp_connected(bool b) {
    if (b != ntp_connected_) {
        if (b) {
            LOG_INFO("NTP connected");
            set_partition_install_date();
        } else {
            LOG_WARNING("NTP disconnected"); // if turned off report it
        }
    }

    ntp_connected_  = b;
    ntp_last_check_ = b ? uuid::get_uptime_sec() : 0;
}

// get NTP status
bool System::ntp_connected() {
    // timeout 2 hours, ntp sync is normally every hour.
    if ((uuid::get_uptime_sec() - ntp_last_check_ > 7201) && ntp_connected_) {
        ntp_connected(false);
    }

    return ntp_connected_;
}

// see if its a BBQKees Gateway by checking the eFuse values
String System::getBBQKeesGatewayDetails(uint8_t detail) {
#ifndef EMSESP_STANDALONE
    union {
        struct {
            uint32_t no : 4;
            uint32_t month : 4;
            uint32_t year : 8;
            uint32_t rev_minor : 4;
            uint32_t rev_major : 4;
            uint32_t model : 4;
            uint32_t mfg : 4;
        };
        uint32_t reg;
    } gw;

    for (uint8_t reg = 0; reg < 8; reg++) {
        gw.reg = esp_efuse_read_reg(EFUSE_BLK3, reg);
        if (reg == 7 || esp_efuse_read_reg(EFUSE_BLK3, reg + 1) == 0)
            break;
    }

    const char * mfg[]   = {"unknown", "BBQKees Electronics", "", "", "", "", "", ""};
    const char * model[] = {"unknown", "S3", "E32V2", "E32V2.2", "S32", "E32", "", "", ""};
    const char * board[] = {"CUSTOM", "S32S3", "E32V2", "E32V2_2", "S32", "E32", "", "", ""};

    switch (detail) {
    case FUSE_VALUE::MFG:
        return gw.mfg < 2 ? String(mfg[gw.mfg]) : "unknown";
    case FUSE_VALUE::MODEL:
        return gw.model < 6 ? String(model[gw.model]) : "unknown";
    case FUSE_VALUE::BOARD:
        return gw.model < 6 ? String(board[gw.model]) : board_profile_;
    case FUSE_VALUE::REV:
        return String(gw.rev_major) + "." + String(gw.rev_minor);
    case FUSE_VALUE::BATCH:
        return String(2000 + gw.year) + (gw.month < 10 ? "0" : "") + String(gw.month) + String(gw.no);
    case FUSE_VALUE::FUSE:
        return "0x" + String(gw.reg, 16);
    case FUSE_VALUE::ALL:
    default:
        break;
    }

    if (!gw.reg || gw.mfg > 1 || gw.model > 5) {
        return "";
    }

